////1st
// 'use strict';
//
// let x = parseInt(prompt('Введите Х', '1'));
// let y = parseInt(prompt('Введите Y', '1'));
// alert('Сумма: ' + (x + y));

//todo =============================================

////2nd
// let x = 2;
// let y = x * 3;
// let z = x + y;
// console.log(x , y , z);

//todo =============================================

////3rd
// let firstName = prompt('Имя', 'John ');
// let lastName = prompt('Фамилию', 'Doe');
// alert('What`s up ' + firstName + lastName);

//todo =============================================

////4th
// 'use strict';
//
// let x = parseInt(prompt('Введите Х', '1'));
// let y = parseInt(prompt('Введите Y', '1'));
// alert(('Произведение: ' + (x * y) + ' ') + ('Частное: ' + (x / y) + ' ') + ('Разность: ' + (x - y) + ' ') + ('Сумма: ' + (x + y) + ' '));

//todo =============================================

////5th
// 'use strict';
//
// let x = parseInt(prompt('Введите Х', '1'));
// let y = Boolean(x % 2);
// alert('Число нечётное: ' + y);

//todo =============================================

////6th
// 'use strict';
//
// let x = parseInt(prompt('Введите кол-во Гигабайт', '1'));
// const m = 1024;
// let y = x * m;
// let z = y * m;
// let w = z * m;
// alert('Количество мегабайт: ' + y + '; '
//     + 'Количество килобайт: ' + z + '; '
//     + 'Количество байт: ' + w+ '; ');

//todo =============================================

////7th
// 'use strict';
//
// let x = parseInt(prompt('У Чжуан-цзы было яблок: ', '1'));
// let y = parseInt(prompt(' Цзэн-Цзы съел яблок у Чжуан-цзы', '1'));
// alert('Чжуан-Цзы обвиняет Цзэн-Цзы в том, что он съел все яблоки, но Цзэн-Цзы возражает. Цзэн-Цзы говорит правду? ' + Boolean(x-y));

//todo =============================================

//8th
'use strict';

let x = parseInt(prompt('У Чжуан-цзы было яблок: ', '1'));
let y = parseInt(prompt(' Цзэн-Цзы съел яблок у Чжуан-цзы', '1'));
alert('Чжуан-Цзы обвиняет Цзэн-Цзы в том, что он съел все яблоки, но Цзэн-Цзы возражает. Цзэн-Цзы говорит правду? ' + Boolean(x-y));