////1st
'use strict';

let x = parseInt(prompt('Введите x', '1'));
let y = parseInt(prompt('Введите y', '2'));
let z = parseInt(prompt('Введите z', '3'));

if ((x < y) && (x < z)){
alert('x - наименьшее значение: ' + x)
} else if ((y < x) && (x < z)) {
    alert('y - наименьшее значение: ' + y)
} else if ((z < x) && (z < y)){
    alert('z - наименьшее значение: ' + z)
} else {
    alert('x , y , z - равны')
}

//todo =============================================


////2nd
// let x = 2;
// let y = x * 3;
// let z = x + y;
// console.log(x , y , z);

//todo =============================================

////3rd
// let firstName = prompt('Имя', 'John ');
// let lastName = prompt('Фамилию', 'Doe');
// alert('What`s up ' + firstName + lastName);

//todo =============================================

////4th
// 'use strict';
//
// let x = parseInt(prompt('Введите Х', '1'));
// let y = parseInt(prompt('Введите Y', '1'));
// alert(('Произведение: ' + (x * y) + ' ') + ('Частное: ' + (x / y) + ' ') + ('Разность: ' + (x - y) + ' ') + ('Сумма: ' + (x + y) + ' '));

//todo =============================================

////5th
// 'use strict';
//
// let x = parseInt(prompt('Введите Х', '1'));
// let y = Boolean(x % 2);
// alert('Число нечётное: ' + y);

//todo =============================================

////6th
// 'use strict';
//
// let x = parseInt(prompt('Введите кол-во Гигабайт', '1'));
// const m = 1024;
// let y = x * m;
// let z = y * m;
// let w = z * m;
// alert('Количество мегабайт: ' + y + '; '
//     + 'Количество килобайт: ' + z + '; '
//     + 'Количество байт: ' + w+ '; ');

//todo =============================================

////7th
// 'use strict';
//
// let x = parseInt(prompt('У Чжуан-цзы было яблок: ', '1'));
// let y = parseInt(prompt(' Цзэн-Цзы съел яблок у Чжуан-цзы', '1'));
// alert('Чжуан-Цзы обвиняет Цзэн-Цзы в том, что он съел все яблоки, но Цзэн-Цзы возражает. Цзэн-Цзы говорит правду? ' + Boolean(x-y));

//todo =============================================

////8th
// 'use strict';
//
// let x = parseInt(prompt('Введите высоту колонки 1: ', '10'));
// let y = parseInt(prompt('Введите высоту колонки 2: ', '20'));
// let z = parseInt(prompt('Введите высоту колонки 3: ', '30'));
// alert('Наибольшая высота колонки: ' + Math.max(x, y, z));

//todo =============================================

////9th
// 'use strict';
//
// let x = parseInt(prompt('Введите скорость полёта корабля(км/час): ', '100'));
// const km = 384400;
// alert('Ваш корабль долетит до земли за: ' + (km / x) + ' часа');

//todo =============================================

// //10th
// 'use strict';
//
// let x = Math.round(Math.random()*100);
// let y = parseInt(prompt('Введите число: ', '32'))
// alert('Результаты сравнения и значения переменных: '
//     + 'x < y= ' + (Boolean(x < y) )
//     + ', x = ' + x
//     + ', y = ' + y );